app/controllers/purchase_orders_controller.rb

  def index
    @purchase_orders = PurchaseOrder.all
---
SELECT "purchase_orders".* FROM "purchase_orders"

  def create
    @purchase_order = PurchaseOrder.new(purchase_order_params)

    respond_to do |format|
      if @purchase_order.save
---
INSERT INTO "purchase_orders" ("date_created", "quantity", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["date_created", "2020-05-06"], ["quantity", 5], ["total_price", 102.98], ["created_at", "2020-05-18 20:26:02.236864"], ["updated_at", "2020-05-18 20:26:02.236864"]]

  def update
    respond_to do |format|
      if @purchase_order.update(purchase_order_params)
---
UPDATE "purchase_orders" SET "quantity" = ?, "total_price" = ?, "updated_at" = ? WHERE "purchase_orders"."id" = ?  [["quantity", 3], ["total_price", 31.99], ["updated_at", "2020-05-19 01:49:37.349187"], ["id", 4]]

  def destroy
    @purchase_order.destroy
---
DELETE FROM "purchase_orders" WHERE "purchase_orders"."id" = ?  [["id", 4]]

    def set_purchase_order
      @purchase_order = PurchaseOrder.find(params[:id])
---
SELECT  "purchase_orders".* FROM "purchase_orders" WHERE "purchase_orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]